КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиДополнительныхРеквизитов/КонтурЛогистика_НастройкиДополнительныхРеквизитов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиДополнительныхРеквизитов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Реквизит</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отображать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТЧ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/CommonModules/КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер/Module.bsl
#Область ПрограммныйИнтерфейс
 
Процедура ПриСозданииНаСервере(Форма) Экспорт
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизиты_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = ОбщийМодуль.СтруктураДополнительныхРеквизитов();
	
	Если СтруктураДополнительныхРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
				
	ОбъектМетаданных = ОбъектМетаданныхПоСсылке(Форма.Объект.Ссылка);
	
	// Добавим добавленные вручную реквизиты в манифест
	Для каждого Реквизит Из ОбъектМетаданных.Реквизиты Цикл
		
		Если Лев(Реквизит.Имя, 16) = "КонтурЛогистика_" И Не СтруктураДополнительныхРеквизитов.Свойство(Реквизит.Имя) Тогда
			
			Попытка 
				
				Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
					Справочники[ОбъектМетаданных.Имя].ДополнитьМанифест(СтруктураДополнительныхРеквизитов);	
				ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
					Документы[ОбъектМетаданных.Имя].ДополнитьМанифест(СтруктураДополнительныхРеквизитов);	
				КонецЕсли;
				
			Исключение
				ОписаниеСтруктурыСвойств = ОбщийМодуль.ОписаниеСтруктурыСвойствДопРеквизита();
				СтруктураДополнительныхРеквизитов.Вставить(Реквизит.Имя, ОписаниеСтруктурыСвойств);	
			КонецПопытки;
			
			Если Не СтруктураДополнительныхРеквизитов.Свойство(Реквизит.Имя) Тогда
				ОписаниеСтруктурыСвойств = ОбщийМодуль.ОписаниеСтруктурыСвойствДопРеквизита();
				СтруктураДополнительныхРеквизитов.Вставить(Реквизит.Имя, ОписаниеСтруктурыСвойств);	
			КонецЕсли;
				
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого ТЧ Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		Для каждого Реквизит Из ТЧ.Реквизиты Цикл
			
			Если Лев(Реквизит.Имя, 16) = "КонтурЛогистика_" И Не СтруктураДополнительныхРеквизитов.Свойство(Реквизит.Имя) Тогда
				
				Попытка 
					
					Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
						Справочники[ОбъектМетаданных.Имя].ДополнитьМанифест(СтруктураДополнительныхРеквизитов);	
					ИначеЕсли Метаданные.Документы.Содержит(ОбъектМетаданных) Тогда
						Документы[ОбъектМетаданных.Имя].ДополнитьМанифест(СтруктураДополнительныхРеквизитов);	
					КонецЕсли;
					
					Если Не СтруктураДополнительныхРеквизитов.Свойство(Реквизит.Имя) Тогда
						ОписаниеСтруктурыСвойств = ОбщийМодуль.ОписаниеСтруктурыСвойствДопРеквизита();
						ОписаниеСтруктурыСвойств.РеквизитТЧ = Истина;
						ОписаниеСтруктурыСвойств.ИмяТЧ = ТЧ.Имя;
						СтруктураДополнительныхРеквизитов.Вставить(Реквизит.Имя, ОписаниеСтруктурыСвойств);	
					КонецЕсли;
					
				Исключение
					ОписаниеСтруктурыСвойств = ОбщийМодуль.ОписаниеСтруктурыСвойствДопРеквизита();
					ОписаниеСтруктурыСвойств.РеквизитТЧ = Истина;
					ОписаниеСтруктурыСвойств.ИмяТЧ = ТЧ.Имя;
					СтруктураДополнительныхРеквизитов.Вставить(Реквизит.Имя, ОписаниеСтруктурыСвойств);	
				КонецПопытки;
							
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
		
	Для каждого ОписаниеРеквизита Из СтруктураДополнительныхРеквизитов Цикл 
				
		Если ОписаниеРеквизита.Значение.РеквизитТЧ Тогда
			
			ВывестиРеквизитТЧ(Форма, ОбъектМетаданных, ОписаниеРеквизита);
											
		Иначе
			
			ВывестиРеквизит(Форма, ОбъектМетаданных, ОписаниеРеквизита);
							
		КонецЕсли;
						
	КонецЦикла;
	
	ПроверитьОтображениеГруппыДополнительныхРеквизитов(Форма, "КонтурЛогистикаДополнительныеРеквизитыГруппаСтраница");
	ПроверитьОтображениеГруппыДополнительныхРеквизитов(Форма, "КонтурЛогистикаДополнительныеРеквизитыГруппа");
				
КонецПроцедуры

Процедура ПередЗаписьюНаСервере(Форма, ТекущийОбъект) Экспорт
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизиты_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = ОбщийМодуль.СтруктураДополнительныхРеквизитов();
	
	Если СтруктураДополнительныхРеквизитов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ОбъектМетаданных = ОбъектМетаданныхПоСсылке(Форма.Объект.Ссылка);
	
	Для каждого ОписаниеРеквизита Из СтруктураДополнительныхРеквизитов Цикл 
				
		Если ОписаниеРеквизита.Значение.РеквизитТЧ Тогда
			
			ИмяРеквизита = ОписаниеРеквизита.Ключ;
			
			ИмяТЧ = ОписаниеРеквизита.Значение.ИмяТЧ;
							
			Если ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТЧ) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Реквизит = ОбъектМетаданных.ТабличныеЧасти[ИмяТЧ].Реквизиты.Найти(ИмяРеквизита);
			
			ТипРеквизита = ОписаниеРеквизита.Значение.Тип;
			ТипЛогистика = ОписаниеРеквизита.Значение.ТипЛогистика;
			
			Для каждого Стр Из Форма.Объект[ИмяТЧ] Цикл
				
				Если Не ЭтоПримитивныйТип(ТипРеквизита)
					И ТипЛогистика Тогда
				
					Индекс = Форма.Объект[ИмяТЧ].Индекс(Стр);
					СтрокаТЧ = ТекущийОбъект[ИмяТЧ].Получить(Индекс);
					
					СтрокаТЧ[ИмяРеквизита] = ПолучитьЗаписываемоеЗначениеРеквизита(Стр[ИмяРеквизита + "_Форма"]);
					
				КонецЕсли;
					
			КонецЦикла;
			
		Иначе
			
			Реквизит = ОбъектМетаданных.Реквизиты.Найти(ОписаниеРеквизита.Ключ);
				    				
			Если Реквизит = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ИмяРеквизита = ОписаниеРеквизита.Ключ;
			ТипРеквизита = ОписаниеРеквизита.Значение.Тип;
			ТипЛогистика = ОписаниеРеквизита.Значение.ТипЛогистика;
			
			Если Не ЭтоПримитивныйТип(ТипРеквизита)
					И ТипЛогистика Тогда
			
				ТекущийОбъект[ИмяРеквизита] = ПолучитьЗаписываемоеЗначениеРеквизита(Форма[ИмяРеквизита]);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПослеЗаписиНаСервере(Форма, ТекущийОбъект) Экспорт

	ПередЗаписьюНаСервере(Форма, ТекущийОбъект);
		
	ТекущийОбъект.ОбменДанными.Загрузка = Истина;
	ТекущийОбъект.Записать();
		
КонецПроцедуры

#КонецОбласти

#Область Автоконвертация

Процедура ЗаполнитьНастройкиДополнительныхРеквизитов(ПерезаполнитьНастройкиКонвертации = Ложь, ТихийРежим) Экспорт

	Попытка
	
		УстановитьПривилегированныйРежим(Истина);		
		Если КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.РасширениеСДополнительнымиРеквизитамиУстановлено() Тогда			
			
			Если ПерезаполнитьНастройкиКонвертации Тогда
				ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(ТихийРежим);
			Иначе
				Если Не КонтурЛогистика_ОбщегоНазначенияСервер.НастройкиДополнительныхРеквизитовЗаполнены()
					И КонтурЛогистика_ОбщегоНазначенияСервер.ЕстьНастройкиКонвертацииДокументов() Тогда			
					ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(ТихийРежим);
					СправочникКонтурЛогистика_НастройкиДополнительныхРеквизитов = Вычислить("Справочники.КонтурЛогистика_НастройкиДополнительныхРеквизитов");
					СправочникКонтурЛогистика_НастройкиДополнительныхРеквизитов.ЗаполнитьПоУмолчанию();
				КонецЕсли;
			КонецЕсли;
						
		КонецЕсли;
		УстановитьПривилегированныйРежим(Ложь);
		
	Исключение
		
		ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
		ТекстОшибки = "Ошибка при заполнение настроек конвертаций дополнительными реквизитами. Ошибка: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка,,, ТекстОшибки);
		
	КонецПопытки
		
КонецПроцедуры

Процедура ЗаполнитьНастройкиКонвертацииДополнительнымиРеквизитами(ТихийРежим = Ложь, Параметры = Неопределено) Экспорт
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизиты_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = ОбщийМодуль.СтруктураДополнительныхРеквизитов();
	
	СписокНастроекКонвертации = Новый Массив;
	
	Для каждого ОписаниеРеквизита Из СтруктураДополнительныхРеквизитов Цикл
		
		Если ОписаниеРеквизита.Значение.СписокСвойствАвтоконвертации.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		ИмяРеквизита = ОписаниеРеквизита.Ключ;
		
		Для Каждого СвойстваАвтоконвертации Из ОписаниеРеквизита.Значение.СписокСвойствАвтоконвертации Цикл
		
			Если Не ЗначениеЗаполнено(СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика)
				Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ТипОбъекта1С)
				Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ТипОбъектаЛогистика)
				Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ОбъектКонфигурации) Тогда
				Продолжить;
			КонецЕсли;
			
			Если Параметры <> Неопределено
				И Параметры.ТипОбъектаЛогистика <> СвойстваАвтоконвертации.ТипОбъектаЛогистика
				И Параметры.ТипОбъекта1С <> СвойстваАвтоконвертации.ТипОбъекта1С 
				И Параметры.РеквизитТитула <> СвойстваАвтоконвертации.РеквизитТитула Тогда				
				Продолжить;	
			КонецЕсли;
			
			НастройкаДопРеквизита = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.ПолучитьНастройкуДопРеквизита(
				ИмяРеквизита, СвойстваАвтоконвертации.ОбъектКонфигурации);
			
			КонтурЛогистика_ОбщегоНазначенияСервер.ВыполнитьНастройкуАвтоконвертации(СписокНастроекКонвертации, НастройкаДопРеквизита, 
				ОписаниеРеквизита.Значение.РеквизитТЧ, ИмяРеквизита, СвойстваАвтоконвертации);
			
		КонецЦикла;
			
	КонецЦикла;
	
	Если Не ТихийРежим Тогда
		КонтурЛогистика_ОбщегоНазначенияСервер.ВывестиСообщенияЗаполненияНастроекДополнительнымиРеквизитами(СписокНастроекКонвертации);
	КонецЕсли;
				
КонецПроцедуры

Процедура ЗаполнитьНастройкуКонвертацииДополнительнымРеквизитом(ИмяРеквизита, Расположение) Экспорт
	
	ОбщийМодуль = КонтурЛогистика_ОбщегоНазначенияСервер.ОбщийМодуль("КонтурЛогистика_ДопРеквизиты_Манифест");
	Если ОбщийМодуль = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СтруктураДополнительныхРеквизитов = ОбщийМодуль.СтруктураДополнительныхРеквизитов();
	
	Если Не СтруктураДополнительныхРеквизитов.Свойство(ИмяРеквизита) Тогда
		Возврат;
	КонецЕсли;
	
	СписокНастроекКонвертации = Новый Массив;
	
	Для Каждого СвойстваАвтоконвертации Из СтруктураДополнительныхРеквизитов[ИмяРеквизита].СписокСвойствАвтоконвертации Цикл
		
		Если Не ЗначениеЗаполнено(СвойстваАвтоконвертации.РеквизитСправочникаИлиДокументаЛогистика)
			Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ТипОбъекта1С)
			Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ТипОбъектаЛогистика)
			Или Не ЗначениеЗаполнено(СвойстваАвтоконвертации.ОбъектКонфигурации) Тогда
			Продолжить;
		КонецЕсли;
		
		НастройкаДопРеквизита = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.ПолучитьНастройкуДопРеквизита(
				ИмяРеквизита, СвойстваАвтоконвертации.ОбъектКонфигурации);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВыполнитьНастройкуАвтоконвертации(СписокНастроекКонвертации, НастройкаДопРеквизита, 
			СтруктураДополнительныхРеквизитов[ИмяРеквизита].РеквизитТЧ,	ИмяРеквизита, СвойстваАвтоконвертации);
		
	КонецЦикла;
		
	КонтурЛогистика_ОбщегоНазначенияСервер.ВывестиСообщенияЗаполненияНастроекДополнительнымиРеквизитами(СписокНастроекКонвертации);
					
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьУсловноеОфрмлениеОтметкаНезаполненного(Форма, ИмяФлажка, ИмяРеквизита)
	
	УсловноеОформление = Форма.УсловноеОформление;
	ЭлементыФормы = Форма.Элементы;
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяРеквизита].Имя);
		
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяФлажка);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяРеквизита);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Истина);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(ЭлементыФормы[ИмяРеквизита].Имя);
	
	Группа1 = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    Группа1.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли; 
	
	ОтборЭлемента = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяФлажка);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ОтборЭлемента = Группа1.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяРеквизита);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Заполнено;
	
	Группа2 = Группа1.Элементы.Добавить(Тип("ГруппаЭлементовОтбораКомпоновкиДанных"));
    Группа2.ТипГруппы = ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИ;
	
	ОтборЭлемента = Группа2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяРеквизита);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ОтборЭлемента = Группа2.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект." + ИмяФлажка);
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Ложь;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
    
КонецПроцедуры

Функция ИмяДополнительногоРасширенияДополнительныеРеквизитыПоИмениКонфигурации(ТипКонфигурации) Экспорт
	
	Если ТипКонфигурации = "УФ_БП"
		Или ТипКонфигурации = "ERP"
		Или ТипКонфигурации = "УФ_УТ"
		Или ТипКонфигурации = "КА_2"
		Или ТипКонфигурации = "УАТ_ПРОФ"
		Или ТипКонфигурации = "УАТ"
		Или ТипКонфигурации = "ТЛЭ"
		Или ТипКонфигурации = "ERP_УАТ"
		Или ТипКонфигурации = "УФ_УНФ" Тогда
		
		Возврат "РасширениеКонтурЛогистика_ДополнительныеРеквизиты";
		
	Иначе
		
		Возврат "";
		
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьОтображениеГруппыДополнительныхРеквизитов(Форма, ИмяГруппы)
	
	ВсеЭлементыСкрыты = Истина;
	
	Группа = Форма.Элементы.Найти(ИмяГруппы);
	Если Группа <> Неопределено Тогда
		
		Для каждого ЭлементФормы Из Группа.ПодчиненныеЭлементы Цикл
			
			Если ТипЗнч(ЭлементФормы.Вид) = Тип("ВидГруппыФормы") Тогда
				ОбойтиГруппу(ЭлементФормы, ВсеЭлементыСкрыты);
			КонецЕсли;
			
			Если ТипЗнч(ЭлементФормы.Вид) = Тип("ВидПоляФормы") И ЭлементФормы.Видимость Тогда
				ВсеЭлементыСкрыты = Ложь;
				Прервать;
			КонецЕсли;
												
		КонецЦикла;
		
		Если ВсеЭлементыСкрыты Тогда
			Группа.Видимость = Ложь;
		КонецЕсли;
		
	КонецЕсли;
			
КонецПроцедуры

Процедура ОбойтиГруппу(Группа, ВсеЭлементыСкрыты)
	
	Для каждого ЭлементФормы Из Группа.ПодчиненныеЭлементы Цикл
		
		Если ТипЗнч(ЭлементФормы.Вид) = Тип("ВидГруппыФормы") Тогда
			ОбойтиГруппу(ЭлементФормы, ВсеЭлементыСкрыты);
		КонецЕсли;
		
		Если ТипЗнч(ЭлементФормы.Вид) = Тип("ВидПоляФормы") И ЭлементФормы.Видимость Тогда
			ВсеЭлементыСкрыты = Ложь;
			Прервать;
		КонецЕсли;
								
	КонецЦикла;
			
КонецПроцедуры

Процедура ВывестиРеквизит(Форма, ОбъектМетаданных, ОписаниеРеквизита)
	
	Реквизит = ОбъектМетаданных.Реквизиты.Найти(ОписаниеРеквизита.Ключ);
			    				
	Если Реквизит = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяРеквизита = ОписаниеРеквизита.Ключ;
	ТипРеквизита = ОписаниеРеквизита.Значение.Тип;
	ТипЛогистика = ОписаниеРеквизита.Значение.ТипЛогистика;
	ДопГруппаГруппировки = ОписаниеРеквизита.Значение.ДопГруппаГруппировки;
	
	ГруппаРодитель = ПолучитьГруппуРодитель(Форма, ДопГруппаГруппировки);
		
	Если Реквизит.Тип.Типы()[0] = Тип("Булево") Тогда
		ВидПоля = 2;
	Иначе
		ВидПоля = 1;	
	КонецЕсли;
	
	Настройка = ПолучитьНастройкуРеквизита(ИмяРеквизита, ОбъектМетаданных);
			
	Если Не ЭтоПримитивныйТип(ТипРеквизита)
		И ТипЛогистика Тогда
		
		Если Форма.Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
		
			ДополнительныеРеквизиты = Новый Массив;
			РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита, Новый ОписаниеТипов(ТипРеквизита));		
			ДополнительныеРеквизиты.Добавить(РеквизитФормы);
			Форма.ИзменитьРеквизиты(ДополнительныеРеквизиты);
								
			СвойстваРеквизита = Новый Структура;
			СвойстваРеквизита.Вставить("Подсказка", Реквизит.Подсказка);
			СвойстваРеквизита.Вставить("Видимость", ?(ЗначениеЗаполнено(Настройка), Настройка.Отображать, Истина));
			СвойстваРеквизита.Вставить("ОтображениеПодсказки", ?(ЗначениеЗаполнено(Реквизит.Подсказка), ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет));
			
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(
				Форма, ИмяРеквизита, ГруппаРодитель, Реквизит.Синоним, 1, ИмяРеквизита, СвойстваРеквизита);
				
		КонецЕсли;
			
		ЗначениеРеквизита = ПолучитьЗначениеРеквизита_(Форма.Объект[ИмяРеквизита], ТипРеквизита);			
		Форма[ИмяРеквизита] = ЗначениеРеквизита;
			
	Иначе
			
		Если Форма.Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			
			СвойстваРеквизита = Новый Структура;
			СвойстваРеквизита.Вставить("Подсказка", Реквизит.Подсказка);
			СвойстваРеквизита.Вставить("Видимость", ?(ЗначениеЗаполнено(Настройка), Настройка.Отображать, Истина));
			СвойстваРеквизита.Вставить("ОтображениеПодсказки", ?(ЗначениеЗаполнено(Реквизит.Подсказка), ОтображениеПодсказки.Кнопка, ОтображениеПодсказки.Нет));
		
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(
				Форма, ИмяРеквизита, ГруппаРодитель, Реквизит.Синоним, ВидПоля, "Объект." + ИмяРеквизита, СвойстваРеквизита);
				
		КонецЕсли;
				
	КонецЕсли;
	
	Если ОписаниеРеквизита.Значение.УсловноеОформлениеОтметкаНезаполненного Тогда
		УстановитьУсловноеОфрмлениеОтметкаНезаполненного(Форма, ОписаниеРеквизита.Значение.УсловноеОформлениеИмяФлажка, ИмяРеквизита);		
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьНастройкуРеквизита(ИмяРеквизита, ОбъектМетаданных)
	
	ИмяОбъектаМетаданных = ?(Метаданные.Справочники.Содержит(ОбъектМетаданных), "Справочник.", "Документ.");
	ИмяОбъектаМетаданных = ИмяОбъектаМетаданных + ОбъектМетаданных.Имя;
	
	Возврат КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.ПолучитьНастройкуДопРеквизита(ИмяРеквизита, ИмяОбъектаМетаданных);	
	
КонецФункции

Процедура ВывестиРеквизитТЧ(Форма, ОбъектМетаданных, ОписаниеРеквизита)

	ИмяРеквизита = ОписаниеРеквизита.Ключ;
				
	ИмяТЧ = ОписаниеРеквизита.Значение.ИмяТЧ;
			
	Если ОбъектМетаданных.ТабличныеЧасти.Найти(ИмяТЧ) = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГруппаРодитель = ПолучитьГруппуРодительТЧ(Форма, ИмяТЧ);
	
	Реквизит = ОбъектМетаданных.ТабличныеЧасти[ИмяТЧ].Реквизиты.Найти(ИмяРеквизита);
	
	ТипРеквизита = ОписаниеРеквизита.Значение.Тип;
	ТипЛогистика = ОписаниеРеквизита.Значение.ТипЛогистика;				
			
	Если Реквизит.Тип.Типы()[0] = Тип("Булево") Тогда
		ВидПоля = 2;
	Иначе
		ВидПоля = 1;	
	КонецЕсли;
	
	Настройка = ПолучитьНастройкуРеквизита(ИмяРеквизита, ОбъектМетаданных);
	
	Если Не ЭтоПримитивныйТип(ТипРеквизита)
		И ТипЛогистика Тогда
		
		Если Форма.Элементы.Найти(ИмяРеквизита + "_Форма") = Неопределено Тогда
		
			ДополнительныеРеквизиты = Новый Массив;
			РеквизитФормы = Новый РеквизитФормы(ИмяРеквизита + "_Форма", Новый ОписаниеТипов(ТипРеквизита), "Объект." + ИмяТЧ);		
			ДополнительныеРеквизиты.Добавить(РеквизитФормы);
			Форма.ИзменитьРеквизиты(ДополнительныеРеквизиты);
			
			СвойстваРеквизита = Новый Структура;
			СвойстваРеквизита.Вставить("Видимость", ?(ЗначениеЗаполнено(Настройка), Настройка.Отображать, Истина));
							
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(
				Форма, ИмяРеквизита + "_Форма", ГруппаРодитель, Реквизит.Синоним, 1, "Объект." + ИмяТЧ + "." + ИмяРеквизита + "_Форма", СвойстваРеквизита);
			
		КонецЕсли;	
		
		Для каждого Стр Из Форма.Объект[ИмяТЧ] Цикл
			
			ЗначениеРеквизита = ПолучитьЗначениеРеквизита_(Стр[ИмяРеквизита], ТипРеквизита);
				
			Стр[ИмяРеквизита + "_Форма"] = ЗначениеРеквизита;					
					
		КонецЦикла;				
		
	Иначе	
		
		Если Форма.Элементы.Найти(ИмяРеквизита) = Неопределено Тогда
			
			СвойстваРеквизита = Новый Структура;
			СвойстваРеквизита.Вставить("Видимость", ?(ЗначениеЗаполнено(Настройка), Настройка.Отображать, Истина));
		
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздПоле(
				Форма, ИмяРеквизита, ГруппаРодитель, Реквизит.Синоним, ВидПоля, "Объект." + ИмяТЧ + "." + ИмяРеквизита, СвойстваРеквизита);
				
		КонецЕсли;
		
	КонецЕсли;
					
КонецПроцедуры

Функция ПолучитьГруппуРодитель(Форма, ИмяДопГруппыГруппировки = "") 

	ГруппаРодитель = Форма.Элементы.Найти("КонтурЛогистикаДополнительныеРеквизитыГруппа");
	Если ГруппаРодитель = Неопределено Тогда
		
		НаОтдельнойСтранице = Ложь;
		
		Если Форма.Элементы.Найти("ГруппаСтраницы") <> Неопределено Тогда
			
			ГруппаСтраницы = Форма.Элементы.Найти("ГруппаСтраницы");
			
			СвойстваГруппы = Новый Структура;
			СвойстваГруппы.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_КонтурЛого16);
			
			ГруппаРодитель = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздСтраница(
				Форма, "КонтурЛогистикаДополнительныеРеквизитыГруппаСтраница", ГруппаСтраницы, "Дополнительные реквизиты",,,, СвойстваГруппы);
				
			НаОтдельнойСтранице = Истина;
				
		ИначеЕсли Форма.Элементы.Найти("ГруппаКомментарий") <> Неопределено Тогда
			ГруппаРодитель = Форма.Элементы.Найти("ГруппаКомментарий");	
		КонецЕсли;
						
		СвойстваГруппы = Новый Структура;
		СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);	
		СвойстваГруппы.Вставить("Отображение", ?(НаОтдельнойСтранице, ОтображениеОбычнойГруппы.Нет, ОтображениеОбычнойГруппы.Нет));
		ГруппаРодитель = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычная(
			Форма, "КонтурЛогистикаДополнительныеРеквизитыГруппа", ГруппаРодитель, "",,,, СвойстваГруппы);
			
		Если Не НаОтдельнойСтранице Тогда
			
			СвойстваГруппы = Новый Структура;
			СвойстваГруппы.Вставить("ВертикальноеПоложениеПодчиненных", ВертикальноеПоложениеЭлемента.Центр);
			СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычная(
				Форма, "КонтурЛогистикаДополнительныеРеквизитыШапка", ГруппаРодитель, "",,,, СвойстваГруппы);	
			
			СвойстваДекорации = Новый Структура;
			СвойстваДекорации.Вставить("Вид", ВидДекорацииФормы.Картинка);
			СвойстваДекорации.Вставить("Картинка", БиблиотекаКартинок.КонтурЛогистика_КонтурЛого16);
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
				Форма, "КонтурЛогистикаДополнительныеРеквизитыДекорация", "КонтурЛогистикаДополнительныеРеквизитыШапка", СвойстваДекорации);
				
			СвойстваДекорации = Новый Структура;
			СвойстваДекорации.Вставить("Заголовок", "Дополнительные реквизиты");
			СвойстваДекорации.Вставить("ЦветТекста", ЦветаСтиля.ЦветТекстаФормы);
			КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздДекорация(
				Форма, "КонтурЛогистикаДополнительныеРеквизитыЗаголовок", "КонтурЛогистикаДополнительныеРеквизитыШапка", СвойстваДекорации);
			
		КонецЕсли;
			
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяДопГруппыГруппировки) Тогда
		
		ДопГруппаГруппировки = Форма.Элементы.Найти("ГруппаКонтурЛогистикаДополнительныеРеквизиты");
		Если ДопГруппаГруппировки = Неопределено Тогда
			
			СвойстваГруппы = Новый Структура;
			СвойстваГруппы.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная);
			СвойстваГруппы.Вставить("ЦветТекстаЗаголовка", ЦветаСтиля.ЦветТекстаФормы);
			СвойстваГруппы.Вставить("ШрифтЗаголовка", Новый Шрифт(, 10, Истина));
			СвойстваГруппы.Вставить("ОтображатьЗаголовок", Ложь);			
			СвойстваГруппы.Вставить("Отображение", ОтображениеОбычнойГруппы.Нет);
			
			ГруппаРодитель = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаОбычная(
				Форма, "КонтурЛогистикаДопГруппаГруппировки" + ИмяДопГруппыГруппировки, ГруппаРодитель,,,,, СвойстваГруппы);
				
		Иначе
				
			ГруппаРодитель = ДопГруппаГруппировки;		
		
		КонецЕсли;
			
	КонецЕсли;
		
	Возврат ГруппаРодитель;
		
КонецФункции

Функция ПолучитьГруппуРодительТЧ(Форма, Знач ИмяТЧ)
	
	ГруппаРодитель = Форма.Элементы.Найти("ГруппаКолонок" + ИмяТЧ + "КонтурЛогистика");
	Если ГруппаРодитель = Неопределено Тогда
		
		ГруппаИмяТЧ = ИмяТЧ;
		
		СвойстваГруппы = Новый Структура;
		СвойстваГруппы.Вставить("ГоризонтальноеПоложениеВШапке", ГоризонтальноеПоложениеЭлемента.Центр);
		СвойстваГруппы.Вставить("КартинкаШапки", БиблиотекаКартинок.КонтурЛогистика_КонтурЛого16);
		
		ГруппаРодитель = КонтурЛогистика_ДинамическоеФормированиеИнтерфейса.СздГруппаКолонокТаблицыФормы(Форма,
			"ГруппаКолонок" + ИмяТЧ + "КонтурЛогистика",
			ГруппаИмяТЧ,
			1,
			0,
			Истина,
			"Дополнительные реквизиты",
			СвойстваГруппы);
			
	КонецЕсли;
	
	Возврат ГруппаРодитель;
	
КонецФункции

Функция ОбъектМетаданныхПоСсылке(Ссылка) 
	Возврат Метаданные.НайтиПоТипу(ТипЗнч(Ссылка));	
КонецФункции

Функция ПолучитьПредставлениеЗначенияРеквизита(Значение) Экспорт  	
	
	Представление = Неопределено;
	
	ОбъектМетаданных = ОбъектМетаданныхПоСсылке(Значение);
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда 
		
		Представление = Значение;
		
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		
		Менеджер = Новый ("ПеречислениеМенеджер." + ОбъектМетаданных.Имя); 
		
		Представление = ОбъектМетаданных.ЗначенияПеречисления[Менеджер.Индекс(Значение)].Синоним;
		
	КонецЕсли;
	
	Возврат Представление;
	
КонецФункции

Функция ПолучитьЗначениеРеквизита_(стрЗначение, стрТип) Экспорт  	
	
	Если Лев(стрТип, 16) = "СправочникСсылка" Тогда
		
		ОбъектМетаданных = ОбъектМетаданныхПоТипу(стрТип);
		
		Возврат Справочники[ОбъектМетаданных.Имя].НайтиПоКоду(стрЗначение);
		
	ИначеЕсли Лев(стрТип, 18) = "ПеречислениеСсылка" Тогда
			
		Если ЗначениеЗаполнено(стрЗначение) Тогда
			
			ОбъектМетаданных = ОбъектМетаданныхПоТипу(стрТип);
			
			Если ОбъектМетаданных <> Неопределено
				И ОбъектМетаданных.ЗначенияПеречисления[стрЗначение] <> Неопределено Тогда
				
				Возврат Перечисления[ОбъектМетаданных.Имя][стрЗначение];	
				
			КонецЕсли;
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли;
		
	КонецЕсли;
		
	Возврат Неопределено;
	
КонецФункции

Функция ОбъектМетаданныхПоТипу(Знач Тип) Экспорт
	
	ИмяМетаданных = Неопределено;
	
	Если ТипЗнч(Тип) = Тип("Строка") Тогда
		Тип = Тип(Тип);	
	КонецЕсли;
	
	ОбъектМетаданных = Метаданные.НайтиПоТипу(Тип);
	
	Возврат ОбъектМетаданных;
	
КонецФункции

Функция ПолучитьИмяФормыВыбора(Тип) Экспорт
	
	ИмяФормы = "";
	
	ОбъектМетаданных = ОбъектМетаданныхПоТипу(Тип);
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда
		ИмяФормы = "Справочник." + ОбъектМетаданных.Имя + ".ФормаВыбора";
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		ИмяФормы = "Перечисление." + ОбъектМетаданных.Имя + ".ФормаВыбора";
	КонецЕсли;
	
	Возврат ИмяФормы;
	 
КонецФункции

Функция ПолучитьЗаписываемоеЗначениеРеквизита(Значение) Экспорт
	
	ОбъектМетаданных = ОбъектМетаданныхПоСсылке(Значение);
	
	Если Метаданные.Справочники.Содержит(ОбъектМетаданных) Тогда 
		
		Возврат Значение.Код;
		
	ИначеЕсли Метаданные.Перечисления.Содержит(ОбъектМетаданных) Тогда
		
		ИмяМетаданных = Значение.Метаданные().Имя;
		Менеджер = Новый ("ПеречислениеМенеджер." + ИмяМетаданных); 
		
		Возврат Значение.Метаданные().ЗначенияПеречисления[Менеджер.Индекс(Значение)].Имя;
		
	КонецЕсли;
	
	Возврат Неопределено;	
	
КонецФункции

Функция ЭтоПеречисление_(Значение)
	
	Если Значение = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ОбъектМетаданных = ОбъектМетаданныхПоСсылке(Значение);
	Возврат Метаданные.Перечисления.Содержит(ОбъектМетаданных);
	
КонецФункции

Функция ЭтоПримитивныйТип(стрТип) Экспорт
	
	Если стрТип = "Булево" Или стрТип = "Число" Или стрТип = "Строка" Или стрТип = "Дата" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;	
	КонецЕсли;
	
КонецФункции

Процедура ПроверитьВычислитьДополнительныйРеквизит(ИмяРеквизита, ЗначениеРеквизита) Экспорт
	
	ТипРеквизита = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСерверПовтИсп.ПолучитьТипЛогистикиДополнительногоРеквизита(ИмяРеквизита);
	Если ЗначениеЗаполнено(ТипРеквизита) Тогда
		
		ЗначениеДопРеквизита = КонтурЛогистика_ИнтеграцияТиповые_ДопРеквизитыСервер.ПолучитьЗначениеРеквизита_(ЗначениеРеквизита, ТипРеквизита);
		Если ЗначениеДопРеквизита <> Неопределено Тогда
			ЗначениеРеквизита = ЗначениеДопРеквизита;	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ЭтоДополнительныйРеквизит(РеквизитОбъектаМетаданных)

	Если РеквизитОбъектаМетаданных.РасширениеКонфигурации() <> Неопределено
		И РеквизитОбъектаМетаданных.РасширениеКонфигурации().Имя = "РасширениеКонтурЛогистика_ДополнительныеРеквизиты" Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь
	КонецЕсли;
	
КонецФункции

#КонецОбласти
